/*
    Compile unit: D:\Pure3d\Simulation\physics\PhLRgdBod.cpp
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x800E3178 -> 0x800E3C3C
*/
// total size: 0xC0
struct {} PhLRgdBody::__vtable; // size: 0xC0, address: 0x801151EC
// total size: 0x230
class PhLRgdBody : public PhRgdBody {
    // Functions
    PhLRgdBody(const class Vector & cm, float vol, float density, const class PhSymMat & i0);

    ~PhLRgdBody();

    class PhBasicObj * Clone();

    unsigned char ValidCollisionForObj(class PhSubSTreeObj * jnt, class PhBasicObj * obj);

    unsigned char TestBranch(class PhSubSTreeObj * ref, class PhSubSTreeObj * obj);

    unsigned char ValidCollision(class PhBasicObj * obj);

    void GetLocalSpeed(const class Vector & pos, class Vector & v) const;

    void StartCollision(const class Vector & pos, const class Vector & dir, class PhBasicObj * o);

    void GetMassMatrix(class Vector & pos, class PhSymMat & m, class PhBasicObj * o);

    unsigned char AddImpulse(class Vector & pos, class Vector & imp, class PhSymMat & m, class PhBasicObj * o);

    void EndCollision(unsigned char fdyn);

    void SetControl(signed short c);

    void SolveAppliedForces(float dt);

    // Members
protected:
    class PhSubSTreeObj * fHand1; // offset 0x1E8, size 0x4
    class PhSubSTreeObj * fHand2; // offset 0x1EC, size 0x4
    class PhSymMat fM1; // offset 0x1F0, size 0x1C
    class PhSymMat fM2; // offset 0x20C, size 0x1C
    unsigned char fAllowSelfColl; // offset 0x228, size 0x1
    int fHandBranchLength; // offset 0x22C, size 0x4
};
// Range: 0x800E3178 -> 0x800E31F4
// this: r1+0x8
PhLRgdBody::PhLRgdBody(const class Vector & cm /* r4 */, float vol /* f1 */, float density /* f2 */, const class PhSymMat & i0 /* r5 */) {
    // References
    // -> struct [anonymous] PhLRgdBody::__vtable;
}

// Range: 0x800E31F4 -> 0x800E3270
// this: r30
PhLRgdBody::~PhLRgdBody() {
    // References
    // -> struct [anonymous] PhLRgdBody::__vtable;
}

// Range: 0x800E3270 -> 0x800E33D0
// this: r28
class PhBasicObj * PhLRgdBody::Clone() {
    // Local variables
    class PhLRgdBody * clone; // r31
    int t; // r30
    int i; // r29

    // References
    // -> struct [anonymous] PhLRgdBody::__vtable;
}

// Range: 0x800E36BC -> 0x800E37EC
// this: r27
unsigned char PhLRgdBody::ValidCollisionForObj(class PhSubSTreeObj * jnt /* r28 */, class PhBasicObj * obj /* r29 */) {
    // Local variables
    unsigned char ret; // r30
}

// total size: 0x28
class iPhEnv : public AccessCounter, protected PhUnits {
    // Members
protected:
    class Vector fGravityCGS; // offset 0xC, size 0xC
    class Vector fGravity; // offset 0x18, size 0xC
    float fGravityNorm; // offset 0x24, size 0x4
};
// total size: 0x0
class tPose {};
// total size: 0x0
class PhPairEl {};
// total size: 0x14
class PhPairElList : public VoidPList {};
// total size: 0xC
class iPhTime : protected PhUnits {
    // Members
protected:
    float fValue; // offset 0x4, size 0x4
    float fValueCGS; // offset 0x8, size 0x4
};
// total size: 0x240
class PhSTreeObj : public PhRgdBody {
    // Members
protected:
    class iPhEnv * fEnv; // offset 0x1E8, size 0x4
    class tPose * fPose; // offset 0x1EC, size 0x4
    class PhSubSTreeObj * fSubObj; // offset 0x1F0, size 0x4
    int fNbSubObj; // offset 0x1F4, size 0x4
    float fDt; // offset 0x1F8, size 0x4
    unsigned char fSubObjUpToDate; // offset 0x1FC, size 0x1
    float fTimeSinceCalcI0; // offset 0x200, size 0x4
    float fTimeCalcI0; // offset 0x204, size 0x4
    float fTimeSinceLastColl; // offset 0x208, size 0x4
    float fMaxJSpeed; // offset 0x20C, size 0x4
    float fInvTWDTDissip; // offset 0x210, size 0x4
    float fInvTWNewDissip; // offset 0x214, size 0x4
    float fInvWDissip; // offset 0x218, size 0x4
    class PhSubSTreeObj * fCollidingJoint; // offset 0x21C, size 0x4
    class PhSubSTreeObj * fSelfCollisionCenter; // offset 0x220, size 0x4
    unsigned char fSelfCollInProcess; // offset 0x224, size 0x1
    class PhPairElList * fPairCollElList; // offset 0x228, size 0x4
private:
    class Vector fCacheW; // offset 0x22C, size 0xC
    int fStartJoint; // offset 0x238, size 0x4
};
// total size: 0x14
class PhSubSTreeObjList : public VoidPList {};
// total size: 0x0
class PhDOFData {};
// total size: 0x150
class PhSubSTreeObj : public PhBasicObj {
    // Members
protected:
    int fIndex; // offset 0x70, size 0x4
    int fParentIndex; // offset 0x74, size 0x4
    class PhSubSTreeObj * fParentSubObj; // offset 0x78, size 0x4
    class PhSTreeObj * fParentObj; // offset 0x7C, size 0x4
    class PhSubSTreeObjList * fLChildSubObj; // offset 0x80, size 0x4
    unsigned char fSimulate; // offset 0x84, size 0x1
    class PhSymMat fI0; // offset 0x88, size 0x1C
    class Vector fCM0; // offset 0xA4, size 0xC
    class Vector fCM; // offset 0xB0, size 0xC
    float fVolume; // offset 0xBC, size 0x4
    float fCMn; // offset 0xC0, size 0x4
    float fInvStiff; // offset 0xC4, size 0x4
    float fLMax; // offset 0xC8, size 0x4
    float fReactScale; // offset 0xCC, size 0x4
    class PhDOFData * fDOFData; // offset 0xD0, size 0x4
    class Matrix fRotMat; // offset 0xD4, size 0x40
    class Vector fW; // offset 0x114, size 0xC
    class Vector fV; // offset 0x120, size 0xC
    class Vector fDV; // offset 0x12C, size 0xC
    float fCacheAbs; // offset 0x138, size 0x4
    unsigned char fSpeedProblem; // offset 0x13C, size 0x1
    float fFakeInvI; // offset 0x140, size 0x4
    float fWeightModifier; // offset 0x144, size 0x4
    unsigned char fMaxSpeedReached; // offset 0x148, size 0x1
    unsigned char fDone; // offset 0x149, size 0x1
};
// Range: 0x800E37EC -> 0x800E3878
// this: r28
unsigned char PhLRgdBody::TestBranch(class PhSubSTreeObj * ref /* r29 */, class PhSubSTreeObj * obj /* r5 */) {
    // Local variables
    unsigned char ret; // r31
    class PhSubSTreeObj * o; // r5
    int i; // r30
}

// Range: 0x800E3878 -> 0x800E38D0
// this: r3
unsigned char PhLRgdBody::ValidCollision(class PhBasicObj * obj /* r5 */) {
    // Local variables
    unsigned char ret; // r6
}

// Range: 0x800E38D0 -> 0x800E3914
// this: r3
void PhLRgdBody::GetLocalSpeed(const class Vector & pos /* r4 */, class Vector & v /* r5 */) const {}

// Range: 0x800E3914 -> 0x800E39D0
// this: r29
void PhLRgdBody::StartCollision(const class Vector & pos /* r30 */, const class Vector & dir /* r31 */, class PhBasicObj * o /* r6 */) {}

// Range: 0x800E39D0 -> 0x800E3AF4
// this: r28
void PhLRgdBody::GetMassMatrix(class Vector & pos /* r29 */, class PhSymMat & m /* r30 */, class PhBasicObj * o /* r31 */) {}

// total size: 0x8
class tRefCounted {
    // Members
public:
    void * __vptr$; // offset 0x0, size 0x4
protected:
    unsigned int refCount; // offset 0x4, size 0x4
};
// total size: 0x10
class tEntity : public tRefCounted {
    // Members
    unsigned long long uid; // offset 0x8, size 0x8
};
// total size: 0x10
class Vector4 : public Vector {
    // Members
public:
    float w; // offset 0xC, size 0x4
};
// total size: 0x40
class Matrix {
    // Members
public:
    float m[4][4]; // offset 0x0, size 0x40
};
// total size: 0xC
class Vector {
    // Members
public:
    float x; // offset 0x0, size 0x4
    float y; // offset 0x4, size 0x4
    float z; // offset 0x8, size 0x4
};
enum CollElEnum {
    CollEl = 0,
    SphereEl = 1,
    CylEl = 2,
    ConeEl = 3,
    OBBoxEl = 4,
    WallEl = 5,
    BBoxEl = 6,
    MaxCollElEnum = 7,
};
// total size: 0x14
class VoidPList {
    // Members
public:
    void * __vptr$; // offset 0x0, size 0x4
protected:
    unsigned char fLock; // offset 0x4, size 0x1
private:
    int fSize; // offset 0x8, size 0x4
    int fArraySize; // offset 0xC, size 0x4
    void * fArray; // offset 0x10, size 0x4
};
// total size: 0x14
class PhCollElList : public VoidPList {};
// total size: 0x1C
class PhSymMat {
    // Members
public:
    void * __vptr$; // offset 0x0, size 0x4
    float xx; // offset 0x4, size 0x4
    float xy; // offset 0x8, size 0x4
    float xz; // offset 0xC, size 0x4
    float yy; // offset 0x10, size 0x4
    float yz; // offset 0x14, size 0x4
    float zz; // offset 0x18, size 0x4
};
// total size: 0x14
class PhBasicObjList : public VoidPList {};
// total size: 0x40
class PhCollEl {
    // Members
public:
    void * __vptr$; // offset 0x0, size 0x4
    class Vector fP; // offset 0x4, size 0xC
    class Vector fBSize; // offset 0x10, size 0xC
    float fSR; // offset 0x1C, size 0x4
protected:
    enum CollElEnum fType; // offset 0x20, size 0x4
    int fObjRef; // offset 0x24, size 0x4
    class PhBasicObj * fObj; // offset 0x28, size 0x4
    class PhCollElList * fSubElemList; // offset 0x2C, size 0x4
    int fLevel; // offset 0x30, size 0x4
    unsigned char fUpdated; // offset 0x34, size 0x1
    unsigned char fApproxBSize; // offset 0x35, size 0x1
private:
    class Vector * fDP; // offset 0x38, size 0x4
    int fAIRef; // offset 0x3C, size 0x4
};
// total size: 0x0
class PhWorld {};
// total size: 0x8
class AccessCounter {
    // Members
public:
    void * __vptr$; // offset 0x0, size 0x4
private:
    int fCount; // offset 0x4, size 0x4
};
// total size: 0x0
class TList {};
// total size: 0x4
class PhUnits {
    // Static members
    static class TList * fList; // size: 0x4
    static float fT; // size: 0x4
    static float fM; // size: 0x4
    static float fL; // size: 0x4
    static unsigned char fUnitSet; // size: 0x1

    // Members
public:
    void * __vptr$; // offset 0x0, size 0x4
};
// total size: 0x24
class iPhBasicObjParam : public AccessCounter, protected PhUnits {
    // Members
protected:
    float fRestCoeff; // offset 0xC, size 0x4
    float fTangRestCoeff; // offset 0x10, size 0x4
    float fFrictCoeff; // offset 0x14, size 0x4
    float fCollDist; // offset 0x18, size 0x4
    float fFrictCoeffCGS; // offset 0x1C, size 0x4
    float fCollDistCGS; // offset 0x20, size 0x4
};
// total size: 0x0
class PhBasicObjState {};
// total size: 0x70
class PhBasicObj : public tEntity {
    // Static members
    static int sPhBasicObjRefIndex; // size: 0x4
    static float Small_Speed; // size: 0x4

    // Members
public:
    void * userData; // offset 0x10, size 0x4
    char fStringData[24]; // offset 0x14, size 0x18
protected:
    class Vector fR; // offset 0x2C, size 0xC
    signed short fType; // offset 0x38, size 0x2
    signed short fControl; // offset 0x3A, size 0x2
    class PhCollEl * fCollEl; // offset 0x3C, size 0x4
    unsigned char fCollElPreUpdated; // offset 0x40, size 0x1
    class PhWorld * fWorld; // offset 0x44, size 0x4
    class iPhBasicObjParam * fBasicParam; // offset 0x48, size 0x4
    unsigned char fCacheEmpty; // offset 0x4C, size 0x1
    unsigned char fHollow; // offset 0x4D, size 0x1
    int fRefIndex; // offset 0x50, size 0x4
    float fSleepTime; // offset 0x54, size 0x4
private:
    unsigned char justCollide; // offset 0x58, size 0x1
    float fTypicalLinVel; // offset 0x5C, size 0x4
    float fTypicalAngVel; // offset 0x60, size 0x4
    float fTypicalLength; // offset 0x64, size 0x4
    float fTypicalPeriod; // offset 0x68, size 0x4
};
// Range: 0x800E3AF4 -> 0x800E3B4C
// this: r3
unsigned char PhLRgdBody::AddImpulse(class Vector & pos /* r4 */, class Vector & imp /* r5 */, class PhSymMat & m /* r6 */, class PhBasicObj * o /* r7 */) {}

// Range: 0x800E3B4C -> 0x800E3BA0
// this: r3
void PhLRgdBody::EndCollision(unsigned char fdyn /* r4 */) {}

// Range: 0x800E3BA0 -> 0x800E3C10
// this: r30
void PhLRgdBody::SetControl(signed short c /* r31 */) {}

// Range: 0x800E3C10 -> 0x800E3C3C
// this: r3
void PhLRgdBody::SolveAppliedForces(float dt /* f1 */) {}

static // total size: 0x8
struct {} tRefCounted::__RTTI; // size: 0x8, address: 0x8013A910
static // total size: 0x8
struct {} tEntity::__RTTI; // size: 0x8, address: 0x8013A920
static // total size: 0x8
struct {} PhBasicObj::__RTTI; // size: 0x8, address: 0x8013A928
static // total size: 0x8
struct {} PhObj::__RTTI; // size: 0x8, address: 0x8013A938
static // total size: 0x8
struct {} PhParticle::__RTTI; // size: 0x8, address: 0x8013A940
static // total size: 0x8
struct {} PhRgdBody::__RTTI; // size: 0x8, address: 0x8013A948
static // total size: 0x8
struct {} PhLRgdBody::__RTTI; // size: 0x8, address: 0x8013A950
// total size: 0x10
class Quaternion {
    // Members
public:
    float w; // offset 0x0, size 0x4
    float x; // offset 0x4, size 0x4
    float y; // offset 0x8, size 0x4
    float z; // offset 0xC, size 0x4
};
// total size: 0x4
class Filter1D {
    // Members
public:
    void * __vptr$; // offset 0x0, size 0x4
};
// total size: 0x14
class SimpleFilter1D : public Filter1D {
    // Members
protected:
    float fDelta; // offset 0x4, size 0x4
    float fDeltaScl; // offset 0x8, size 0x4
    float fPrevMeasurement; // offset 0xC, size 0x4
    float fDt; // offset 0x10, size 0x4
};
// total size: 0x1E8
class PhRgdBody : public PhParticle {
    // Members
protected:
    class Vector fRcm; // offset 0x120, size 0xC
    class Vector fDRcm0; // offset 0x12C, size 0xC
    unsigned char fDRcmNot0; // offset 0x138, size 0x1
    class Vector fL; // offset 0x13C, size 0xC
    class Vector fW; // offset 0x148, size 0xC
    class PhSymMat fI0; // offset 0x154, size 0x1C
    class PhSymMat fI; // offset 0x170, size 0x1C
    class PhSymMat fIinv; // offset 0x18C, size 0x1C
    class Vector fT; // offset 0x1A8, size 0xC
    class Vector fCacheL; // offset 0x1B4, size 0xC
    class Quaternion fQ; // offset 0x1C0, size 0x10
    class SimpleFilter1D fAngRestCond1D_mag; // offset 0x1D0, size 0x14
};
// total size: 0x14
class iPhDynObjParam : public AccessCounter, protected PhUnits {
    // Members
protected:
    float fDensity; // offset 0xC, size 0x4
    float fDensityCGS; // offset 0x10, size 0x4
};
// total size: 0x4
class Filter3D {
    // Members
public:
    void * __vptr$; // offset 0x0, size 0x4
};
// total size: 0x2C
class SimpleFilter3D : public Filter3D {
    // Members
protected:
    class Vector fDelta; // offset 0x4, size 0xC
    class Vector fDeltaScl; // offset 0x10, size 0xC
    class Vector fPrevMeasurement; // offset 0x1C, size 0xC
    float fDt; // offset 0x28, size 0x4
};
// total size: 0x2C
class SimpleFilterAbs3D : public SimpleFilter3D {};
// total size: 0xC
class iPhSpeed : protected PhUnits {
    // Members
protected:
    float fValue; // offset 0x4, size 0x4
    float fValueCGS; // offset 0x8, size 0x4
};
// total size: 0xC
class PhSpeed : public iPhSpeed {};
// total size: 0x120
class PhParticle : public PhObj {
    // Members
protected:
    float fInvMass; // offset 0xB8, size 0x4
    float fMass; // offset 0xBC, size 0x4
    float fVolumei; // offset 0xC0, size 0x4
    float fVolume; // offset 0xC4, size 0x4
    class Vector fV; // offset 0xC8, size 0xC
    class iPhDynObjParam * fDynParam; // offset 0xD4, size 0x4
    class Vector fCacheV; // offset 0xD8, size 0xC
    class Vector fF; // offset 0xE4, size 0xC
    signed short fTmpCtrl; // offset 0xF0, size 0x2
    class SimpleFilterAbs3D fLinRestCond; // offset 0xF4, size 0x2C
};
// total size: 0xB8
class PhObj : public PhBasicObj {
    // Members
protected:
    class Matrix fRotMat; // offset 0x70, size 0x40
    float fScaleFact; // offset 0xB0, size 0x4
};



