/*
    Compile unit: c:\dolphin\build\libraries\os\src\OSMutex.c
    Producer: MW EABI PPC C-Compiler
    Language: C89
    Code range: 0x8001107C -> 0x800112C8
*/
// total size: 0x2C8
struct OSContext {
    // Members
    unsigned long gpr[32]; // offset 0x0, size 0x80
    unsigned long cr; // offset 0x80, size 0x4
    unsigned long lr; // offset 0x84, size 0x4
    unsigned long ctr; // offset 0x88, size 0x4
    unsigned long xer; // offset 0x8C, size 0x4
    double fpr[32]; // offset 0x90, size 0x100
    unsigned long fpscr_pad; // offset 0x190, size 0x4
    unsigned long fpscr; // offset 0x194, size 0x4
    unsigned long srr0; // offset 0x198, size 0x4
    unsigned long srr1; // offset 0x19C, size 0x4
    unsigned short mode; // offset 0x1A0, size 0x2
    unsigned short state; // offset 0x1A2, size 0x2
    unsigned long gqr[8]; // offset 0x1A4, size 0x20
    double psf[32]; // offset 0x1C8, size 0x100
};
// total size: 0x8
struct OSThreadLink {
    // Members
    struct OSThread * next; // offset 0x0, size 0x4
    struct OSThread * prev; // offset 0x4, size 0x4
};
// total size: 0x8
struct OSMutexQueue {
    // Members
    struct OSMutex * head; // offset 0x0, size 0x4
    struct OSMutex * tail; // offset 0x4, size 0x4
};
// total size: 0x310
struct OSThread {
    // Members
    struct OSContext context; // offset 0x0, size 0x2C8
    unsigned short state; // offset 0x2C8, size 0x2
    unsigned short attr; // offset 0x2CA, size 0x2
    long suspend; // offset 0x2CC, size 0x4
    long priority; // offset 0x2D0, size 0x4
    long base; // offset 0x2D4, size 0x4
    void * val; // offset 0x2D8, size 0x4
    struct OSThreadQueue * queue; // offset 0x2DC, size 0x4
    struct OSThreadLink link; // offset 0x2E0, size 0x8
    struct OSThreadQueue queueJoin; // offset 0x2E8, size 0x8
    struct OSMutex * mutex; // offset 0x2F0, size 0x4
    struct OSMutexQueue queueMutex; // offset 0x2F4, size 0x8
    struct OSThreadLink linkActive; // offset 0x2FC, size 0x8
    unsigned char * stackBase; // offset 0x304, size 0x4
    unsigned long * stackEnd; // offset 0x308, size 0x4
};
// total size: 0x8
struct OSThreadQueue {
    // Members
    struct OSThread * head; // offset 0x0, size 0x4
    struct OSThread * tail; // offset 0x4, size 0x4
};
// total size: 0x8
struct OSMutexLink {
    // Members
    struct OSMutex * next; // offset 0x0, size 0x4
    struct OSMutex * prev; // offset 0x4, size 0x4
};
// total size: 0x18
struct OSMutex {
    // Members
    struct OSThreadQueue queue; // offset 0x0, size 0x8
    struct OSThread * thread; // offset 0x8, size 0x4
    long count; // offset 0xC, size 0x4
    struct OSMutexLink link; // offset 0x10, size 0x8
};
// Range: 0x8001107C -> 0x800110B4
void OSInitMutex(struct OSMutex * mutex /* r31 */) {}

// Range: 0x800110B4 -> 0x80011190
void OSLockMutex(struct OSMutex * mutex /* r28 */) {
    // Local variables
    int enabled; // r29
    struct OSThread * currentThread; // r1+0x8
    struct OSThread * ownerThread; // r1+0x8
    struct OSMutex * __prev; // r1+0x8
}

// Range: 0x80011190 -> 0x80011258
void OSUnlockMutex(struct OSMutex * mutex /* r29 */) {
    // Local variables
    int enabled; // r31
    struct OSThread * currentThread; // r30
    struct OSMutex * __next; // r1+0x8
    struct OSMutex * __prev; // r4
}

// Range: 0x80011258 -> 0x800112C8
void __OSUnlockAllMutex(struct OSThread * thread /* r30 */) {
    // Local variables
    struct OSMutex * mutex; // r3
    struct OSMutex * __next; // r1+0x8
}

// total size: 0x8
struct OSCond {
    // Members
    struct OSThreadQueue queue; // offset 0x0, size 0x8
};



